12/data/attachments/7932beed638ba389.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_43330617-2f07-4ec0-9ef2-ead5f48dd75b</nif:username>
            <nif:friendToBeAdded>Joseph_far_Actions_82495_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>